Tekla Open API Reference for Tekla Structures 2025
Profile.FormatProfileString Method
 Formats profile string
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static string FormatProfileString(
	string profileString
)
Public Shared Function FormatProfileString (
	profileString As String
) As String
Parameters
profileString
Type: System.String
profile string
Return Value
Type: String
Formatted profile string, if not successful returns original string
See Also
Reference
Profile Class
Tekla.Structures.Model Namespace